README: Change diagram to mermaid
What do we think?
